Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pmu.h
/**
 * \brief Component description for PMU
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-01-20T19:13:34Z */
#ifndef _BZ45_PMU_COMPONENT_H_
#define _BZ45_PMU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PMU                                          */
/* ************************************************************************** */

/* -------- PMU_SPICTRL : (PMU Offset: 0x00) (R/W 32)  -------- */
#define PMU_SPICTRL_RESETVALUE                _U_(0x00)                                            /**<  (PMU_SPICTRL)   Reset Value */

#define PMU_SPICTRL_SPIWDATA_Pos              _U_(0)                                               /**< (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIWDATA_Msk              (_U_(0xFFFF) << PMU_SPICTRL_SPIWDATA_Pos)            /**< (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIWDATA(value)           (PMU_SPICTRL_SPIWDATA_Msk & ((value) << PMU_SPICTRL_SPIWDATA_Pos))
#define PMU_SPICTRL_SPIADDR_Pos               _U_(16)                                              /**< (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIADDR_Msk               (_U_(0xFF) << PMU_SPICTRL_SPIADDR_Pos)               /**< (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIADDR(value)            (PMU_SPICTRL_SPIADDR_Msk & ((value) << PMU_SPICTRL_SPIADDR_Pos))
#define PMU_SPICTRL_CMD_Pos                   _U_(24)                                              /**< (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_CMD_Msk                   (_U_(0x1) << PMU_SPICTRL_CMD_Pos)                    /**< (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_CMD(value)                (PMU_SPICTRL_CMD_Msk & ((value) << PMU_SPICTRL_CMD_Pos))
#define PMU_SPICTRL_PMUCRST_Pos               _U_(30)                                              /**< (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_PMUCRST_Msk               (_U_(0x1) << PMU_SPICTRL_PMUCRST_Pos)                /**< (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_PMUCRST(value)            (PMU_SPICTRL_PMUCRST_Msk & ((value) << PMU_SPICTRL_PMUCRST_Pos))
#define PMU_SPICTRL_SPIRST_Pos                _U_(31)                                              /**< (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIRST_Msk                (_U_(0x1) << PMU_SPICTRL_SPIRST_Pos)                 /**< (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIRST(value)             (PMU_SPICTRL_SPIRST_Msk & ((value) << PMU_SPICTRL_SPIRST_Pos))
#define PMU_SPICTRL_Msk                       _U_(0xC1FFFFFF)                                      /**< (PMU_SPICTRL) Register Mask  */


/* -------- PMU_SPISTATUS : (PMU Offset: 0x04) (R/W 32)  -------- */
#define PMU_SPISTATUS_RESETVALUE              _U_(0x00)                                            /**<  (PMU_SPISTATUS)   Reset Value */

#define PMU_SPISTATUS_SPIERR_Pos              _U_(0)                                               /**< (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIERR_Msk              (_U_(0x1) << PMU_SPISTATUS_SPIERR_Pos)               /**< (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIERR(value)           (PMU_SPISTATUS_SPIERR_Msk & ((value) << PMU_SPISTATUS_SPIERR_Pos))
#define PMU_SPISTATUS_SPIRDY_Pos              _U_(7)                                               /**< (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIRDY_Msk              (_U_(0x1) << PMU_SPISTATUS_SPIRDY_Pos)               /**< (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIRDY(value)           (PMU_SPISTATUS_SPIRDY_Msk & ((value) << PMU_SPISTATUS_SPIRDY_Pos))
#define PMU_SPISTATUS_SPIADDR_Pos             _U_(8)                                               /**< (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIADDR_Msk             (_U_(0xFF) << PMU_SPISTATUS_SPIADDR_Pos)             /**< (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIADDR(value)          (PMU_SPISTATUS_SPIADDR_Msk & ((value) << PMU_SPISTATUS_SPIADDR_Pos))
#define PMU_SPISTATUS_SPIRDATA_Pos            _U_(16)                                              /**< (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIRDATA_Msk            (_U_(0xFFFF) << PMU_SPISTATUS_SPIRDATA_Pos)          /**< (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIRDATA(value)         (PMU_SPISTATUS_SPIRDATA_Msk & ((value) << PMU_SPISTATUS_SPIRDATA_Pos))
#define PMU_SPISTATUS_Msk                     _U_(0xFFFFFF81)                                      /**< (PMU_SPISTATUS) Register Mask  */


/* -------- PMU_CLKCTRL : (PMU Offset: 0x08) (R/W 32)  -------- */
#define PMU_CLKCTRL_RESETVALUE                _U_(0x00)                                            /**<  (PMU_CLKCTRL)   Reset Value */

#define PMU_CLKCTRL_SPICLKDIV_Pos             _U_(0)                                               /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_SPICLKDIV_Msk             (_U_(0x3F) << PMU_CLKCTRL_SPICLKDIV_Pos)             /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_SPICLKDIV(value)          (PMU_CLKCTRL_SPICLKDIV_Msk & ((value) << PMU_CLKCTRL_SPICLKDIV_Pos))
#define PMU_CLKCTRL_PMUANA_BKBOREN_Pos        _U_(6)                                               /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_PMUANA_BKBOREN_Msk        (_U_(0x1) << PMU_CLKCTRL_PMUANA_BKBOREN_Pos)         /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_PMUANA_BKBOREN(value)     (PMU_CLKCTRL_PMUANA_BKBOREN_Msk & ((value) << PMU_CLKCTRL_PMUANA_BKBOREN_Pos))
#define PMU_CLKCTRL_SPISRC_Pos                _U_(7)                                               /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_SPISRC_Msk                (_U_(0x1) << PMU_CLKCTRL_SPISRC_Pos)                 /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_SPISRC(value)             (PMU_CLKCTRL_SPISRC_Msk & ((value) << PMU_CLKCTRL_SPISRC_Pos))
#define PMU_CLKCTRL_BUCKCLKDIV_Pos            _U_(8)                                               /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKCLKDIV_Msk            (_U_(0x3F) << PMU_CLKCTRL_BUCKCLKDIV_Pos)            /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKCLKDIV(value)         (PMU_CLKCTRL_BUCKCLKDIV_Msk & ((value) << PMU_CLKCTRL_BUCKCLKDIV_Pos))
#define PMU_CLKCTRL_BUCKSRC_Pos               _U_(14)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKSRC_Msk               (_U_(0x3) << PMU_CLKCTRL_BUCKSRC_Pos)                /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKSRC(value)            (PMU_CLKCTRL_BUCKSRC_Msk & ((value) << PMU_CLKCTRL_BUCKSRC_Pos))
#define PMU_CLKCTRL_BACWD_Pos                 _U_(16)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BACWD_Msk                 (_U_(0x1) << PMU_CLKCTRL_BACWD_Pos)                  /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BACWD(value)              (PMU_CLKCTRL_BACWD_Msk & ((value) << PMU_CLKCTRL_BACWD_Pos))
#define PMU_CLKCTRL_MLDOEXTEN_Pos             _U_(17)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MLDOEXTEN_Msk             (_U_(0x1) << PMU_CLKCTRL_MLDOEXTEN_Pos)              /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MLDOEXTEN(value)          (PMU_CLKCTRL_MLDOEXTEN_Msk & ((value) << PMU_CLKCTRL_MLDOEXTEN_Pos))
#define PMU_CLKCTRL_MVREFFSMEN_Pos            _U_(18)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MVREFFSMEN_Msk            (_U_(0x1) << PMU_CLKCTRL_MVREFFSMEN_Pos)             /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MVREFFSMEN(value)         (PMU_CLKCTRL_MVREFFSMEN_Msk & ((value) << PMU_CLKCTRL_MVREFFSMEN_Pos))
#define PMU_CLKCTRL_CMP_CYCLE_Pos             _U_(20)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_CMP_CYCLE_Msk             (_U_(0xF) << PMU_CLKCTRL_CMP_CYCLE_Pos)              /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_CMP_CYCLE(value)          (PMU_CLKCTRL_CMP_CYCLE_Msk & ((value) << PMU_CLKCTRL_CMP_CYCLE_Pos))
#define PMU_CLKCTRL_BKCLK_HW_OVR_Pos          _U_(24)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BKCLK_HW_OVR_Msk          (_U_(0x1) << PMU_CLKCTRL_BKCLK_HW_OVR_Pos)           /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BKCLK_HW_OVR(value)       (PMU_CLKCTRL_BKCLK_HW_OVR_Msk & ((value) << PMU_CLKCTRL_BKCLK_HW_OVR_Pos))
#define PMU_CLKCTRL_MLDOEXT_BOREN_Pos         _U_(26)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MLDOEXT_BOREN_Msk         (_U_(0x1) << PMU_CLKCTRL_MLDOEXT_BOREN_Pos)          /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MLDOEXT_BOREN(value)      (PMU_CLKCTRL_MLDOEXT_BOREN_Msk & ((value) << PMU_CLKCTRL_MLDOEXT_BOREN_Pos))
#define PMU_CLKCTRL_ADCBOREN_Pos              _U_(27)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_ADCBOREN_Msk              (_U_(0x1) << PMU_CLKCTRL_ADCBOREN_Pos)               /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_ADCBOREN(value)           (PMU_CLKCTRL_ADCBOREN_Msk & ((value) << PMU_CLKCTRL_ADCBOREN_Pos))
#define PMU_CLKCTRL_BUCKBOREN_Pos             _U_(28)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKBOREN_Msk             (_U_(0x1) << PMU_CLKCTRL_BUCKBOREN_Pos)              /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKBOREN(value)          (PMU_CLKCTRL_BUCKBOREN_Msk & ((value) << PMU_CLKCTRL_BUCKBOREN_Pos))
#define PMU_CLKCTRL_F_BCLK_CFG_Pos            _U_(29)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_F_BCLK_CFG_Msk            (_U_(0x1) << PMU_CLKCTRL_F_BCLK_CFG_Pos)             /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_F_BCLK_CFG(value)         (PMU_CLKCTRL_F_BCLK_CFG_Msk & ((value) << PMU_CLKCTRL_F_BCLK_CFG_Pos))
#define PMU_CLKCTRL_WLDOOFF_Pos               _U_(30)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_WLDOOFF_Msk               (_U_(0x1) << PMU_CLKCTRL_WLDOOFF_Pos)                /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_WLDOOFF(value)            (PMU_CLKCTRL_WLDOOFF_Msk & ((value) << PMU_CLKCTRL_WLDOOFF_Pos))
#define PMU_CLKCTRL_WCMRET_Pos                _U_(31)                                              /**< (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_WCMRET_Msk                (_U_(0x1) << PMU_CLKCTRL_WCMRET_Pos)                 /**< (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_WCMRET(value)             (PMU_CLKCTRL_WCMRET_Msk & ((value) << PMU_CLKCTRL_WCMRET_Pos))
#define PMU_CLKCTRL_Msk                       _U_(0xFDF7FFFF)                                      /**< (PMU_CLKCTRL) Register Mask  */


/* -------- PMU_MODECTRL1 : (PMU Offset: 0x0C) (R/W 32)  -------- */
#define PMU_MODECTRL1_RESETVALUE              _U_(0x00)                                            /**<  (PMU_MODECTRL1)   Reset Value */

