Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pmu.h
#define PMU_MODECTRL1_VREG4CTRL_Pos           _U_(0)                                               /**< (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG4CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL1_VREG4CTRL_Pos)           /**< (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG4CTRL(value)        (PMU_MODECTRL1_VREG4CTRL_Msk & ((value) << PMU_MODECTRL1_VREG4CTRL_Pos))
#define PMU_MODECTRL1_VREG3CTRL_Pos           _U_(8)                                               /**< (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG3CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL1_VREG3CTRL_Pos)           /**< (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG3CTRL(value)        (PMU_MODECTRL1_VREG3CTRL_Msk & ((value) << PMU_MODECTRL1_VREG3CTRL_Pos))
#define PMU_MODECTRL1_VREG2CTRL_Pos           _U_(16)                                              /**< (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG2CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL1_VREG2CTRL_Pos)           /**< (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG2CTRL(value)        (PMU_MODECTRL1_VREG2CTRL_Msk & ((value) << PMU_MODECTRL1_VREG2CTRL_Pos))
#define PMU_MODECTRL1_VREG1CTRL_Pos           _U_(24)                                              /**< (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG1CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL1_VREG1CTRL_Pos)           /**< (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG1CTRL(value)        (PMU_MODECTRL1_VREG1CTRL_Msk & ((value) << PMU_MODECTRL1_VREG1CTRL_Pos))
#define PMU_MODECTRL1_BUCKMODE_Pos            _U_(29)                                              /**< (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_BUCKMODE_Msk            (_U_(0x1) << PMU_MODECTRL1_BUCKMODE_Pos)             /**< (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_BUCKMODE(value)         (PMU_MODECTRL1_BUCKMODE_Msk & ((value) << PMU_MODECTRL1_BUCKMODE_Pos))
#define PMU_MODECTRL1_MLDOEN_Pos              _U_(30)                                              /**< (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_MLDOEN_Msk              (_U_(0x1) << PMU_MODECTRL1_MLDOEN_Pos)               /**< (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_MLDOEN(value)           (PMU_MODECTRL1_MLDOEN_Msk & ((value) << PMU_MODECTRL1_MLDOEN_Pos))
#define PMU_MODECTRL1_BUCKEN_Pos              _U_(31)                                              /**< (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_BUCKEN_Msk              (_U_(0x1) << PMU_MODECTRL1_BUCKEN_Pos)               /**< (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_BUCKEN(value)           (PMU_MODECTRL1_BUCKEN_Msk & ((value) << PMU_MODECTRL1_BUCKEN_Pos))
#define PMU_MODECTRL1_Msk                     _U_(0xFF1F1F1F)                                      /**< (PMU_MODECTRL1) Register Mask  */


/* -------- PMU_MODECTRL2 : (PMU Offset: 0x10) (R/W 32)  -------- */
#define PMU_MODECTRL2_RESETVALUE              _U_(0x00)                                            /**<  (PMU_MODECTRL2)   Reset Value */

#define PMU_MODECTRL2_VREG4CTRL_Pos           _U_(0)                                               /**< (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG4CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL2_VREG4CTRL_Pos)           /**< (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG4CTRL(value)        (PMU_MODECTRL2_VREG4CTRL_Msk & ((value) << PMU_MODECTRL2_VREG4CTRL_Pos))
#define PMU_MODECTRL2_VREG3CTRL_Pos           _U_(8)                                               /**< (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG3CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL2_VREG3CTRL_Pos)           /**< (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG3CTRL(value)        (PMU_MODECTRL2_VREG3CTRL_Msk & ((value) << PMU_MODECTRL2_VREG3CTRL_Pos))
#define PMU_MODECTRL2_VREG2CTRL_Pos           _U_(16)                                              /**< (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG2CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL2_VREG2CTRL_Pos)           /**< (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG2CTRL(value)        (PMU_MODECTRL2_VREG2CTRL_Msk & ((value) << PMU_MODECTRL2_VREG2CTRL_Pos))
#define PMU_MODECTRL2_VREG1CTRL_Pos           _U_(24)                                              /**< (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG1CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL2_VREG1CTRL_Pos)           /**< (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG1CTRL(value)        (PMU_MODECTRL2_VREG1CTRL_Msk & ((value) << PMU_MODECTRL2_VREG1CTRL_Pos))
#define PMU_MODECTRL2_BUCKMODE_Pos            _U_(29)                                              /**< (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_BUCKMODE_Msk            (_U_(0x1) << PMU_MODECTRL2_BUCKMODE_Pos)             /**< (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_BUCKMODE(value)         (PMU_MODECTRL2_BUCKMODE_Msk & ((value) << PMU_MODECTRL2_BUCKMODE_Pos))
#define PMU_MODECTRL2_MLDOEN_Pos              _U_(30)                                              /**< (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_MLDOEN_Msk              (_U_(0x1) << PMU_MODECTRL2_MLDOEN_Pos)               /**< (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_MLDOEN(value)           (PMU_MODECTRL2_MLDOEN_Msk & ((value) << PMU_MODECTRL2_MLDOEN_Pos))
#define PMU_MODECTRL2_BUCKEN_Pos              _U_(31)                                              /**< (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_BUCKEN_Msk              (_U_(0x1) << PMU_MODECTRL2_BUCKEN_Pos)               /**< (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_BUCKEN(value)           (PMU_MODECTRL2_BUCKEN_Msk & ((value) << PMU_MODECTRL2_BUCKEN_Pos))
#define PMU_MODECTRL2_Msk                     _U_(0xFF1F1F1F)                                      /**< (PMU_MODECTRL2) Register Mask  */


/* -------- PMU_MODECTRL3 : (PMU Offset: 0x14) (R/W 32)  -------- */
#define PMU_MODECTRL3_RESETVALUE              _U_(0x00)                                            /**<  (PMU_MODECTRL3)   Reset Value */

#define PMU_MODECTRL3_VREG4CTRL_Pos           _U_(0)                                               /**< (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG4CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL3_VREG4CTRL_Pos)           /**< (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG4CTRL(value)        (PMU_MODECTRL3_VREG4CTRL_Msk & ((value) << PMU_MODECTRL3_VREG4CTRL_Pos))
#define PMU_MODECTRL3_VREG3CTRL_Pos           _U_(8)                                               /**< (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG3CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL3_VREG3CTRL_Pos)           /**< (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG3CTRL(value)        (PMU_MODECTRL3_VREG3CTRL_Msk & ((value) << PMU_MODECTRL3_VREG3CTRL_Pos))
#define PMU_MODECTRL3_VREG2CTRL_Pos           _U_(16)                                              /**< (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG2CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL3_VREG2CTRL_Pos)           /**< (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG2CTRL(value)        (PMU_MODECTRL3_VREG2CTRL_Msk & ((value) << PMU_MODECTRL3_VREG2CTRL_Pos))
#define PMU_MODECTRL3_VREG1CTRL_Pos           _U_(24)                                              /**< (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG1CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL3_VREG1CTRL_Pos)           /**< (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG1CTRL(value)        (PMU_MODECTRL3_VREG1CTRL_Msk & ((value) << PMU_MODECTRL3_VREG1CTRL_Pos))
#define PMU_MODECTRL3_BUCKMODE_Pos            _U_(29)                                              /**< (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_BUCKMODE_Msk            (_U_(0x1) << PMU_MODECTRL3_BUCKMODE_Pos)             /**< (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_BUCKMODE(value)         (PMU_MODECTRL3_BUCKMODE_Msk & ((value) << PMU_MODECTRL3_BUCKMODE_Pos))
#define PMU_MODECTRL3_MLDOEN_Pos              _U_(30)                                              /**< (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_MLDOEN_Msk              (_U_(0x1) << PMU_MODECTRL3_MLDOEN_Pos)               /**< (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_MLDOEN(value)           (PMU_MODECTRL3_MLDOEN_Msk & ((value) << PMU_MODECTRL3_MLDOEN_Pos))
#define PMU_MODECTRL3_BUCKEN_Pos              _U_(31)                                              /**< (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_BUCKEN_Msk              (_U_(0x1) << PMU_MODECTRL3_BUCKEN_Pos)               /**< (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_BUCKEN(value)           (PMU_MODECTRL3_BUCKEN_Msk & ((value) << PMU_MODECTRL3_BUCKEN_Pos))
#define PMU_MODECTRL3_Msk                     _U_(0xFF1F1F1F)                                      /**< (PMU_MODECTRL3) Register Mask  */


/* -------- PMU_MODECTRL4 : (PMU Offset: 0x18) (R/W 32)  -------- */
#define PMU_MODECTRL4_RESETVALUE              _U_(0x00)                                            /**<  (PMU_MODECTRL4)   Reset Value */

