Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pmu.h
#define PMU_MODECTRL4_VREG4CTRL_Pos           _U_(0)                                               /**< (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG4CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL4_VREG4CTRL_Pos)           /**< (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG4CTRL(value)        (PMU_MODECTRL4_VREG4CTRL_Msk & ((value) << PMU_MODECTRL4_VREG4CTRL_Pos))
#define PMU_MODECTRL4_VREG3CTRL_Pos           _U_(8)                                               /**< (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG3CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL4_VREG3CTRL_Pos)           /**< (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG3CTRL(value)        (PMU_MODECTRL4_VREG3CTRL_Msk & ((value) << PMU_MODECTRL4_VREG3CTRL_Pos))
#define PMU_MODECTRL4_VREG2CTRL_Pos           _U_(16)                                              /**< (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG2CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL4_VREG2CTRL_Pos)           /**< (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG2CTRL(value)        (PMU_MODECTRL4_VREG2CTRL_Msk & ((value) << PMU_MODECTRL4_VREG2CTRL_Pos))
#define PMU_MODECTRL4_VREG1CTRL_Pos           _U_(24)                                              /**< (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG1CTRL_Msk           (_U_(0x1F) << PMU_MODECTRL4_VREG1CTRL_Pos)           /**< (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG1CTRL(value)        (PMU_MODECTRL4_VREG1CTRL_Msk & ((value) << PMU_MODECTRL4_VREG1CTRL_Pos))
#define PMU_MODECTRL4_BUCKMODE_Pos            _U_(29)                                              /**< (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_BUCKMODE_Msk            (_U_(0x1) << PMU_MODECTRL4_BUCKMODE_Pos)             /**< (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_BUCKMODE(value)         (PMU_MODECTRL4_BUCKMODE_Msk & ((value) << PMU_MODECTRL4_BUCKMODE_Pos))
#define PMU_MODECTRL4_MLDOEN_Pos              _U_(30)                                              /**< (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_MLDOEN_Msk              (_U_(0x1) << PMU_MODECTRL4_MLDOEN_Pos)               /**< (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_MLDOEN(value)           (PMU_MODECTRL4_MLDOEN_Msk & ((value) << PMU_MODECTRL4_MLDOEN_Pos))
#define PMU_MODECTRL4_BUCKEN_Pos              _U_(31)                                              /**< (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_BUCKEN_Msk              (_U_(0x1) << PMU_MODECTRL4_BUCKEN_Pos)               /**< (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_BUCKEN(value)           (PMU_MODECTRL4_BUCKEN_Msk & ((value) << PMU_MODECTRL4_BUCKEN_Pos))
#define PMU_MODECTRL4_Msk                     _U_(0xFF1F1F1F)                                      /**< (PMU_MODECTRL4) Register Mask  */


/* -------- PMU_OVERCTRL : (PMU Offset: 0x1C) (R/W 32)  -------- */
#define PMU_OVERCTRL_RESETVALUE               _U_(0x00)                                            /**<  (PMU_OVERCTRL)   Reset Value */

#define PMU_OVERCTRL_VREG4OCTRL_Pos           _U_(0)                                               /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG4OCTRL_Msk           (_U_(0x1F) << PMU_OVERCTRL_VREG4OCTRL_Pos)           /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG4OCTRL(value)        (PMU_OVERCTRL_VREG4OCTRL_Msk & ((value) << PMU_OVERCTRL_VREG4OCTRL_Pos))
#define PMU_OVERCTRL_VREG3OCTRL_Pos           _U_(8)                                               /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG3OCTRL_Msk           (_U_(0x1F) << PMU_OVERCTRL_VREG3OCTRL_Pos)           /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG3OCTRL(value)        (PMU_OVERCTRL_VREG3OCTRL_Msk & ((value) << PMU_OVERCTRL_VREG3OCTRL_Pos))
#define PMU_OVERCTRL_VREG2OCTRL_Pos           _U_(16)                                              /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG2OCTRL_Msk           (_U_(0x1F) << PMU_OVERCTRL_VREG2OCTRL_Pos)           /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG2OCTRL(value)        (PMU_OVERCTRL_VREG2OCTRL_Msk & ((value) << PMU_OVERCTRL_VREG2OCTRL_Pos))
#define PMU_OVERCTRL_PHWC_Pos                 _U_(22)                                              /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_PHWC_Msk                 (_U_(0x1) << PMU_OVERCTRL_PHWC_Pos)                  /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_PHWC(value)              (PMU_OVERCTRL_PHWC_Msk & ((value) << PMU_OVERCTRL_PHWC_Pos))
#define PMU_OVERCTRL_OVEREN_Pos               _U_(23)                                              /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OVEREN_Msk               (_U_(0x1) << PMU_OVERCTRL_OVEREN_Pos)                /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OVEREN(value)            (PMU_OVERCTRL_OVEREN_Msk & ((value) << PMU_OVERCTRL_OVEREN_Pos))
#define PMU_OVERCTRL_VREG1OCTRL_Pos           _U_(24)                                              /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG1OCTRL_Msk           (_U_(0x1F) << PMU_OVERCTRL_VREG1OCTRL_Pos)           /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG1OCTRL(value)        (PMU_OVERCTRL_VREG1OCTRL_Msk & ((value) << PMU_OVERCTRL_VREG1OCTRL_Pos))
#define PMU_OVERCTRL_OBUCKMODE_Pos            _U_(29)                                              /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OBUCKMODE_Msk            (_U_(0x1) << PMU_OVERCTRL_OBUCKMODE_Pos)             /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OBUCKMODE(value)         (PMU_OVERCTRL_OBUCKMODE_Msk & ((value) << PMU_OVERCTRL_OBUCKMODE_Pos))
#define PMU_OVERCTRL_OMLDOEN_Pos              _U_(30)                                              /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OMLDOEN_Msk              (_U_(0x1) << PMU_OVERCTRL_OMLDOEN_Pos)               /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OMLDOEN(value)           (PMU_OVERCTRL_OMLDOEN_Msk & ((value) << PMU_OVERCTRL_OMLDOEN_Pos))
#define PMU_OVERCTRL_OBUCKEN_Pos              _U_(31)                                              /**< (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OBUCKEN_Msk              (_U_(0x1) << PMU_OVERCTRL_OBUCKEN_Pos)               /**< (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OBUCKEN(value)           (PMU_OVERCTRL_OBUCKEN_Msk & ((value) << PMU_OVERCTRL_OBUCKEN_Pos))
#define PMU_OVERCTRL_Msk                      _U_(0xFFDF1F1F)                                      /**< (PMU_OVERCTRL) Register Mask  */


