Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pmu.h
/* -------- PMU_PMUCMODE : (PMU Offset: 0x20) (R/W 32)  -------- */
#define PMU_PMUCMODE_RESETVALUE               _U_(0x00)                                            /**<  (PMU_PMUCMODE)   Reset Value */

#define PMU_PMUCMODE_CVREG4OCTRL_Pos          _U_(0)                                               /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG4OCTRL_Msk          (_U_(0x1F) << PMU_PMUCMODE_CVREG4OCTRL_Pos)          /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG4OCTRL(value)       (PMU_PMUCMODE_CVREG4OCTRL_Msk & ((value) << PMU_PMUCMODE_CVREG4OCTRL_Pos))
#define PMU_PMUCMODE_CVREG3OCTRL_Pos          _U_(8)                                               /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG3OCTRL_Msk          (_U_(0x1F) << PMU_PMUCMODE_CVREG3OCTRL_Pos)          /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG3OCTRL(value)       (PMU_PMUCMODE_CVREG3OCTRL_Msk & ((value) << PMU_PMUCMODE_CVREG3OCTRL_Pos))
#define PMU_PMUCMODE_CVREG2OCTROL_Pos         _U_(16)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG2OCTROL_Msk         (_U_(0x1F) << PMU_PMUCMODE_CVREG2OCTROL_Pos)         /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG2OCTROL(value)      (PMU_PMUCMODE_CVREG2OCTROL_Msk & ((value) << PMU_PMUCMODE_CVREG2OCTROL_Pos))
#define PMU_PMUCMODE_ADCBOR_Pos               _U_(21)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_ADCBOR_Msk               (_U_(0x1) << PMU_PMUCMODE_ADCBOR_Pos)                /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_ADCBOR(value)            (PMU_PMUCMODE_ADCBOR_Msk & ((value) << PMU_PMUCMODE_ADCBOR_Pos))
#define PMU_PMUCMODE_BUCKBOR_Pos              _U_(22)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_BUCKBOR_Msk              (_U_(0x1) << PMU_PMUCMODE_BUCKBOR_Pos)               /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_BUCKBOR(value)           (PMU_PMUCMODE_BUCKBOR_Msk & ((value) << PMU_PMUCMODE_BUCKBOR_Pos))
#define PMU_PMUCMODE_MLDOEXTBOR_Pos           _U_(23)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_MLDOEXTBOR_Msk           (_U_(0x1) << PMU_PMUCMODE_MLDOEXTBOR_Pos)            /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_MLDOEXTBOR(value)        (PMU_PMUCMODE_MLDOEXTBOR_Msk & ((value) << PMU_PMUCMODE_MLDOEXTBOR_Pos))
#define PMU_PMUCMODE_CVREG1OCTRL_Pos          _U_(24)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG1OCTRL_Msk          (_U_(0x1F) << PMU_PMUCMODE_CVREG1OCTRL_Pos)          /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG1OCTRL(value)       (PMU_PMUCMODE_CVREG1OCTRL_Msk & ((value) << PMU_PMUCMODE_CVREG1OCTRL_Pos))
#define PMU_PMUCMODE_CBUCKMODE_Pos            _U_(29)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CBUCKMODE_Msk            (_U_(0x1) << PMU_PMUCMODE_CBUCKMODE_Pos)             /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CBUCKMODE(value)         (PMU_PMUCMODE_CBUCKMODE_Msk & ((value) << PMU_PMUCMODE_CBUCKMODE_Pos))
#define PMU_PMUCMODE_CMLDOEN_Pos              _U_(30)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CMLDOEN_Msk              (_U_(0x1) << PMU_PMUCMODE_CMLDOEN_Pos)               /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CMLDOEN(value)           (PMU_PMUCMODE_CMLDOEN_Msk & ((value) << PMU_PMUCMODE_CMLDOEN_Pos))
#define PMU_PMUCMODE_CBUCKEN_Pos              _U_(31)                                              /**< (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CBUCKEN_Msk              (_U_(0x1) << PMU_PMUCMODE_CBUCKEN_Pos)               /**< (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CBUCKEN(value)           (PMU_PMUCMODE_CBUCKEN_Msk & ((value) << PMU_PMUCMODE_CBUCKEN_Pos))
#define PMU_PMUCMODE_Msk                      _U_(0xFFFF1F1F)                                      /**< (PMU_PMUCMODE) Register Mask  */


/* -------- PMU_PMUSTATUS : (PMU Offset: 0x24) (R/W 32)  -------- */
#define PMU_PMUSTATUS_RESETVALUE              _U_(0x00)                                            /**<  (PMU_PMUSTATUS)   Reset Value */

#define PMU_PMUSTATUS_PMUSTATUS_Pos           _U_(0)                                               /**< (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_PMUSTATUS_Msk           (_U_(0x1F) << PMU_PMUSTATUS_PMUSTATUS_Pos)           /**< (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_PMUSTATUS(value)        (PMU_PMUSTATUS_PMUSTATUS_Msk & ((value) << PMU_PMUSTATUS_PMUSTATUS_Pos))
#define PMU_PMUSTATUS_WCMRM_Pos               _U_(5)                                               /**< (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_WCMRM_Msk               (_U_(0x1) << PMU_PMUSTATUS_WCMRM_Pos)                /**< (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_WCMRM(value)            (PMU_PMUSTATUS_WCMRM_Msk & ((value) << PMU_PMUSTATUS_WCMRM_Pos))
#define PMU_PMUSTATUS_PMUANA_BUCKBOR_Pos      _U_(6)                                               /**< (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_PMUANA_BUCKBOR_Msk      (_U_(0x1) << PMU_PMUSTATUS_PMUANA_BUCKBOR_Pos)       /**< (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_PMUANA_BUCKBOR(value)   (PMU_PMUSTATUS_PMUANA_BUCKBOR_Msk & ((value) << PMU_PMUSTATUS_PMUANA_BUCKBOR_Pos))
#define PMU_PMUSTATUS_BSSEDATA_Pos            _U_(8)                                               /**< (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_BSSEDATA_Msk            (_U_(0xFFFF) << PMU_PMUSTATUS_BSSEDATA_Pos)          /**< (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_BSSEDATA(value)         (PMU_PMUSTATUS_BSSEDATA_Msk & ((value) << PMU_PMUSTATUS_BSSEDATA_Pos))
#define PMU_PMUSTATUS_BSSENUM_Pos             _U_(24)                                              /**< (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_BSSENUM_Msk             (_U_(0x7F) << PMU_PMUSTATUS_BSSENUM_Pos)             /**< (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_BSSENUM(value)          (PMU_PMUSTATUS_BSSENUM_Msk & ((value) << PMU_PMUSTATUS_BSSENUM_Pos))
#define PMU_PMUSTATUS_BSSERR_Pos              _U_(31)                                              /**< (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_BSSERR_Msk              (_U_(0x1) << PMU_PMUSTATUS_BSSERR_Pos)               /**< (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_BSSERR(value)           (PMU_PMUSTATUS_BSSERR_Msk & ((value) << PMU_PMUSTATUS_BSSERR_Pos))
#define PMU_PMUSTATUS_Msk                     _U_(0xFFFFFF7F)                                      /**< (PMU_PMUSTATUS) Register Mask  */


/* -------- PMU_PMUSEQ1 : (PMU Offset: 0x28) (R/W 32)  -------- */
#define PMU_PMUSEQ1_RESETVALUE                _U_(0x00)                                            /**<  (PMU_PMUSEQ1)   Reset Value */

#define PMU_PMUSEQ1_DELAY_Pos                 _U_(0)                                               /**< (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_DELAY_Msk                 (_U_(0x3F) << PMU_PMUSEQ1_DELAY_Pos)                 /**< (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_DELAY(value)              (PMU_PMUSEQ1_DELAY_Msk & ((value) << PMU_PMUSEQ1_DELAY_Pos))
#define PMU_PMUSEQ1_CMPBVAL_Pos               _U_(6)                                               /**< (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_CMPBVAL_Msk               (_U_(0x1) << PMU_PMUSEQ1_CMPBVAL_Pos)                /**< (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_CMPBVAL(value)            (PMU_PMUSEQ1_CMPBVAL_Msk & ((value) << PMU_PMUSEQ1_CMPBVAL_Pos))
#define PMU_PMUSEQ1_CMD_Pos                   _U_(7)                                               /**< (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_CMD_Msk                   (_U_(0x1) << PMU_PMUSEQ1_CMD_Pos)                    /**< (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_CMD(value)                (PMU_PMUSEQ1_CMD_Msk & ((value) << PMU_PMUSEQ1_CMD_Pos))
#define PMU_PMUSEQ1_SPIRADDR_Pos              _U_(8)                                               /**< (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_SPIRADDR_Msk              (_U_(0xFF) << PMU_PMUSEQ1_SPIRADDR_Pos)              /**< (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_SPIRADDR(value)           (PMU_PMUSEQ1_SPIRADDR_Msk & ((value) << PMU_PMUSEQ1_SPIRADDR_Pos))
#define PMU_PMUSEQ1_SPIDATA_Pos               _U_(16)                                              /**< (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_SPIDATA_Msk               (_U_(0xFFFF) << PMU_PMUSEQ1_SPIDATA_Pos)             /**< (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_SPIDATA(value)            (PMU_PMUSEQ1_SPIDATA_Msk & ((value) << PMU_PMUSEQ1_SPIDATA_Pos))
#define PMU_PMUSEQ1_Msk                       _U_(0xFFFFFFFF)                                      /**< (PMU_PMUSEQ1) Register Mask  */


