Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pmu.h
/* -------- PMU_PMUCFG : (PMU Offset: 0x38) (R/W 32)  -------- */
#define PMU_PMUCFG_RESETVALUE                 _U_(0x00)                                            /**<  (PMU_PMUCFG)   Reset Value */

#define PMU_PMUCFG_BUCK_SW_DELAY_Pos          _U_(0)                                               /**< (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_SW_DELAY_Msk          (_U_(0x7F) << PMU_PMUCFG_BUCK_SW_DELAY_Pos)          /**< (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_SW_DELAY(value)       (PMU_PMUCFG_BUCK_SW_DELAY_Msk & ((value) << PMU_PMUCFG_BUCK_SW_DELAY_Pos))
#define PMU_PMUCFG_MLDO_SW_DELAY_Pos          _U_(8)                                               /**< (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_MLDO_SW_DELAY_Msk          (_U_(0x3F) << PMU_PMUCFG_MLDO_SW_DELAY_Pos)          /**< (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_MLDO_SW_DELAY(value)       (PMU_PMUCFG_MLDO_SW_DELAY_Msk & ((value) << PMU_PMUCFG_MLDO_SW_DELAY_Pos))
#define PMU_PMUCFG_MLDOEXT_l_Pos              _U_(14)                                              /**< (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_MLDOEXT_l_Msk              (_U_(0x3) << PMU_PMUCFG_MLDOEXT_l_Pos)               /**< (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_MLDOEXT_l(value)           (PMU_PMUCFG_MLDOEXT_l_Msk & ((value) << PMU_PMUCFG_MLDOEXT_l_Pos))
#define PMU_PMUCFG_BUCK_CP_L_Pos              _U_(16)                                              /**< (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_CP_L_Msk              (_U_(0xF) << PMU_PMUCFG_BUCK_CP_L_Pos)               /**< (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_CP_L(value)           (PMU_PMUCFG_BUCK_CP_L_Msk & ((value) << PMU_PMUCFG_BUCK_CP_L_Pos))
#define PMU_PMUCFG_BUCK_CP_H_Pos              _U_(20)                                              /**< (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_CP_H_Msk              (_U_(0xF) << PMU_PMUCFG_BUCK_CP_H_Pos)               /**< (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_CP_H(value)           (PMU_PMUCFG_BUCK_CP_H_Msk & ((value) << PMU_PMUCFG_BUCK_CP_H_Pos))
#define PMU_PMUCFG_ADC_CP_L_Pos               _U_(24)                                              /**< (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_ADC_CP_L_Msk               (_U_(0xF) << PMU_PMUCFG_ADC_CP_L_Pos)                /**< (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_ADC_CP_L(value)            (PMU_PMUCFG_ADC_CP_L_Msk & ((value) << PMU_PMUCFG_ADC_CP_L_Pos))
#define PMU_PMUCFG_ADC_CP_H_Pos               _U_(28)                                              /**< (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_ADC_CP_H_Msk               (_U_(0xF) << PMU_PMUCFG_ADC_CP_H_Pos)                /**< (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_ADC_CP_H(value)            (PMU_PMUCFG_ADC_CP_H_Msk & ((value) << PMU_PMUCFG_ADC_CP_H_Pos))
#define PMU_PMUCFG_Msk                        _U_(0xFFFFFF7F)                                      /**< (PMU_PMUCFG) Register Mask  */


/* -------- PMU_WCMCMD : (PMU Offset: 0x3C) (R/W 32)  -------- */
#define PMU_WCMCMD_RESETVALUE                 _U_(0x00)                                            /**<  (PMU_WCMCMD)   Reset Value */

#define PMU_WCMCMD_WCMADDR_Pos                _U_(0)                                               /**< (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_WCMADDR_Msk                (_U_(0x7FF) << PMU_WCMCMD_WCMADDR_Pos)               /**< (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_WCMADDR(value)             (PMU_WCMCMD_WCMADDR_Msk & ((value) << PMU_WCMCMD_WCMADDR_Pos))
#define PMU_WCMCMD_WCMCLKDIV_Pos              _U_(16)                                              /**< (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_WCMCLKDIV_Msk              (_U_(0x7) << PMU_WCMCMD_WCMCLKDIV_Pos)               /**< (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_WCMCLKDIV(value)           (PMU_WCMCMD_WCMCLKDIV_Msk & ((value) << PMU_WCMCMD_WCMCLKDIV_Pos))
#define PMU_WCMCMD_WCMRDU_Pos                 _U_(28)                                              /**< (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_WCMRDU_Msk                 (_U_(0x1) << PMU_WCMCMD_WCMRDU_Pos)                  /**< (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_WCMRDU(value)              (PMU_WCMCMD_WCMRDU_Msk & ((value) << PMU_WCMCMD_WCMRDU_Pos))
#define PMU_WCMCMD_CMD_Pos                    _U_(30)                                              /**< (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_CMD_Msk                    (_U_(0x1) << PMU_WCMCMD_CMD_Pos)                     /**< (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_CMD(value)                 (PMU_WCMCMD_CMD_Msk & ((value) << PMU_WCMCMD_CMD_Pos))
#define PMU_WCMCMD_MODE_Pos                   _U_(31)                                              /**< (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_MODE_Msk                   (_U_(0x1) << PMU_WCMCMD_MODE_Pos)                    /**< (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_MODE(value)                (PMU_WCMCMD_MODE_Msk & ((value) << PMU_WCMCMD_MODE_Pos))
#define PMU_WCMCMD_Msk                        _U_(0xD00707FF)                                      /**< (PMU_WCMCMD) Register Mask  */


/* -------- PMU_WCMWDATA : (PMU Offset: 0x40) (R/W 32)  -------- */
#define PMU_WCMWDATA_RESETVALUE               _U_(0x00)                                            /**<  (PMU_WCMWDATA)   Reset Value */

#define PMU_WCMWDATA_WCMWDATA_Pos             _U_(0)                                               /**< (PMU_WCMWDATA)  Position */
#define PMU_WCMWDATA_WCMWDATA_Msk             (_U_(0xFFFFFFFF) << PMU_WCMWDATA_WCMWDATA_Pos)       /**< (PMU_WCMWDATA)  Mask */
#define PMU_WCMWDATA_WCMWDATA(value)          (PMU_WCMWDATA_WCMWDATA_Msk & ((value) << PMU_WCMWDATA_WCMWDATA_Pos))
#define PMU_WCMWDATA_Msk                      _U_(0xFFFFFFFF)                                      /**< (PMU_WCMWDATA) Register Mask  */


/* -------- PMU_WCMRDATA : (PMU Offset: 0x44) (R/W 32)  -------- */
#define PMU_WCMRDATA_RESETVALUE               _U_(0x00)                                            /**<  (PMU_WCMRDATA)   Reset Value */

#define PMU_WCMRDATA_WCMRDATA_Pos             _U_(0)                                               /**< (PMU_WCMRDATA)  Position */
#define PMU_WCMRDATA_WCMRDATA_Msk             (_U_(0xFFFFFFFF) << PMU_WCMRDATA_WCMRDATA_Pos)       /**< (PMU_WCMRDATA)  Mask */
#define PMU_WCMRDATA_WCMRDATA(value)          (PMU_WCMRDATA_WCMRDATA_Msk & ((value) << PMU_WCMRDATA_WCMRDATA_Pos))
#define PMU_WCMRDATA_Msk                      _U_(0xFFFFFFFF)                                      /**< (PMU_WCMRDATA) Register Mask  */


/* -------- PMU_VBCCMD : (PMU Offset: 0x48) (R/W 32)  -------- */
#define PMU_VBCCMD_RESETVALUE                 _U_(0x00)                                            /**<  (PMU_VBCCMD)   Reset Value */

#define PMU_VBCCMD_VBCADDR_Pos                _U_(0)                                               /**< (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_VBCADDR_Msk                (_U_(0xFFFF) << PMU_VBCCMD_VBCADDR_Pos)              /**< (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_VBCADDR(value)             (PMU_VBCCMD_VBCADDR_Msk & ((value) << PMU_VBCCMD_VBCADDR_Pos))
#define PMU_VBCCMD_VBCRDY_Pos                 _U_(28)                                              /**< (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_VBCRDY_Msk                 (_U_(0x1) << PMU_VBCCMD_VBCRDY_Pos)                  /**< (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_VBCRDY(value)              (PMU_VBCCMD_VBCRDY_Msk & ((value) << PMU_VBCCMD_VBCRDY_Pos))
#define PMU_VBCCMD_CMD_Pos                    _U_(30)                                              /**< (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_CMD_Msk                    (_U_(0x1) << PMU_VBCCMD_CMD_Pos)                     /**< (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_CMD(value)                 (PMU_VBCCMD_CMD_Msk & ((value) << PMU_VBCCMD_CMD_Pos))
#define PMU_VBCCMD_Msk                        _U_(0x5000FFFF)                                      /**< (PMU_VBCCMD) Register Mask  */


/* -------- PMU_VBCWDATA : (PMU Offset: 0x4C) (R/W 32)  -------- */
#define PMU_VBCWDATA_RESETVALUE               _U_(0x00)                                            /**<  (PMU_VBCWDATA)   Reset Value */

#define PMU_VBCWDATA_VBCWDATA_Pos             _U_(0)                                               /**< (PMU_VBCWDATA)  Position */
#define PMU_VBCWDATA_VBCWDATA_Msk             (_U_(0xFFFFFFFF) << PMU_VBCWDATA_VBCWDATA_Pos)       /**< (PMU_VBCWDATA)  Mask */
#define PMU_VBCWDATA_VBCWDATA(value)          (PMU_VBCWDATA_VBCWDATA_Msk & ((value) << PMU_VBCWDATA_VBCWDATA_Pos))
#define PMU_VBCWDATA_Msk                      _U_(0xFFFFFFFF)                                      /**< (PMU_VBCWDATA) Register Mask  */


/* -------- PMU_VBCRDATA : (PMU Offset: 0x50) (R/W 32)  -------- */
#define PMU_VBCRDATA_RESETVALUE               _U_(0x00)                                            /**<  (PMU_VBCRDATA)   Reset Value */

