Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pmu.h
#define PMU_VBCRDATA_VBCRDATA_Pos             _U_(0)                                               /**< (PMU_VBCRDATA)  Position */
#define PMU_VBCRDATA_VBCRDATA_Msk             (_U_(0xFFFFFFFF) << PMU_VBCRDATA_VBCRDATA_Pos)       /**< (PMU_VBCRDATA)  Mask */
#define PMU_VBCRDATA_VBCRDATA(value)          (PMU_VBCRDATA_VBCRDATA_Msk & ((value) << PMU_VBCRDATA_VBCRDATA_Pos))
#define PMU_VBCRDATA_Msk                      _U_(0xFFFFFFFF)                                      /**< (PMU_VBCRDATA) Register Mask  */


/* -------- PMU_WCMCFG : (PMU Offset: 0x54) (R/W 32)  -------- */
#define PMU_WCMCFG_RESETVALUE                 _U_(0x00)                                            /**<  (PMU_WCMCFG)   Reset Value */

#define PMU_WCMCFG_WCM1CFG_Pos                _U_(0)                                               /**< (PMU_WCMCFG)  Position */
#define PMU_WCMCFG_WCM1CFG_Msk                (_U_(0x7) << PMU_WCMCFG_WCM1CFG_Pos)                 /**< (PMU_WCMCFG)  Mask */
#define PMU_WCMCFG_WCM1CFG(value)             (PMU_WCMCFG_WCM1CFG_Msk & ((value) << PMU_WCMCFG_WCM1CFG_Pos))
#define PMU_WCMCFG_WCM2CFG_Pos                _U_(4)                                               /**< (PMU_WCMCFG)  Position */
#define PMU_WCMCFG_WCM2CFG_Msk                (_U_(0x7) << PMU_WCMCFG_WCM2CFG_Pos)                 /**< (PMU_WCMCFG)  Mask */
#define PMU_WCMCFG_WCM2CFG(value)             (PMU_WCMCFG_WCM2CFG_Msk & ((value) << PMU_WCMCFG_WCM2CFG_Pos))
#define PMU_WCMCFG_Msk                        _U_(0x00000077)                                      /**< (PMU_WCMCFG) Register Mask  */


/* -------- PMU_PMUIENB : (PMU Offset: 0x58) (R/W 32)  -------- */
#define PMU_PMUIENB_RESETVALUE                _U_(0x00)                                            /**<  (PMU_PMUIENB)   Reset Value */

#define PMU_PMUIENB_ADCBORIEN_Pos             _U_(0)                                               /**< (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_ADCBORIEN_Msk             (_U_(0x1) << PMU_PMUIENB_ADCBORIEN_Pos)              /**< (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_ADCBORIEN(value)          (PMU_PMUIENB_ADCBORIEN_Msk & ((value) << PMU_PMUIENB_ADCBORIEN_Pos))
#define PMU_PMUIENB_BUCKBORIEN_Pos            _U_(1)                                               /**< (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_BUCKBORIEN_Msk            (_U_(0x1) << PMU_PMUIENB_BUCKBORIEN_Pos)             /**< (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_BUCKBORIEN(value)         (PMU_PMUIENB_BUCKBORIEN_Msk & ((value) << PMU_PMUIENB_BUCKBORIEN_Pos))
#define PMU_PMUIENB_SCMPIEN_Pos               _U_(2)                                               /**< (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_SCMPIEN_Msk               (_U_(0x1) << PMU_PMUIENB_SCMPIEN_Pos)                /**< (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_SCMPIEN(value)            (PMU_PMUIENB_SCMPIEN_Msk & ((value) << PMU_PMUIENB_SCMPIEN_Pos))
#define PMU_PMUIENB_WCMIAIEN_Pos              _U_(3)                                               /**< (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_WCMIAIEN_Msk              (_U_(0x1) << PMU_PMUIENB_WCMIAIEN_Pos)               /**< (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_WCMIAIEN(value)           (PMU_PMUIENB_WCMIAIEN_Msk & ((value) << PMU_PMUIENB_WCMIAIEN_Pos))
#define PMU_PMUIENB_VBCIAIEN_Pos              _U_(4)                                               /**< (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_VBCIAIEN_Msk              (_U_(0x1) << PMU_PMUIENB_VBCIAIEN_Pos)               /**< (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_VBCIAIEN(value)           (PMU_PMUIENB_VBCIAIEN_Msk & ((value) << PMU_PMUIENB_VBCIAIEN_Pos))
#define PMU_PMUIENB_Msk                       _U_(0x0000001F)                                      /**< (PMU_PMUIENB) Register Mask  */


/* -------- PMU_PMUISTAT : (PMU Offset: 0x5C) (R/W 32)  -------- */
#define PMU_PMUISTAT_RESETVALUE               _U_(0x00)                                            /**<  (PMU_PMUISTAT)   Reset Value */

#define PMU_PMUISTAT_ADCBORINT_Pos            _U_(0)                                               /**< (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_ADCBORINT_Msk            (_U_(0x1) << PMU_PMUISTAT_ADCBORINT_Pos)             /**< (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_ADCBORINT(value)         (PMU_PMUISTAT_ADCBORINT_Msk & ((value) << PMU_PMUISTAT_ADCBORINT_Pos))
#define PMU_PMUISTAT_BUCKBORINT_Pos           _U_(1)                                               /**< (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_BUCKBORINT_Msk           (_U_(0x1) << PMU_PMUISTAT_BUCKBORINT_Pos)            /**< (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_BUCKBORINT(value)        (PMU_PMUISTAT_BUCKBORINT_Msk & ((value) << PMU_PMUISTAT_BUCKBORINT_Pos))
#define PMU_PMUISTAT_SCMPINT_Pos              _U_(2)                                               /**< (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_SCMPINT_Msk              (_U_(0x1) << PMU_PMUISTAT_SCMPINT_Pos)               /**< (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_SCMPINT(value)           (PMU_PMUISTAT_SCMPINT_Msk & ((value) << PMU_PMUISTAT_SCMPINT_Pos))
#define PMU_PMUISTAT_WCMIAINT_Pos             _U_(3)                                               /**< (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_WCMIAINT_Msk             (_U_(0x1) << PMU_PMUISTAT_WCMIAINT_Pos)              /**< (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_WCMIAINT(value)          (PMU_PMUISTAT_WCMIAINT_Msk & ((value) << PMU_PMUISTAT_WCMIAINT_Pos))
#define PMU_PMUISTAT_VBCIAINT_Pos             _U_(4)                                               /**< (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_VBCIAINT_Msk             (_U_(0x1) << PMU_PMUISTAT_VBCIAINT_Pos)              /**< (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_VBCIAINT(value)          (PMU_PMUISTAT_VBCIAINT_Msk & ((value) << PMU_PMUISTAT_VBCIAINT_Pos))
#define PMU_PMUISTAT_Msk                      _U_(0x0000001F)                                      /**< (PMU_PMUISTAT) Register Mask  */


/** \brief PMU register offsets definitions */
#define PMU_SPICTRL_REG_OFST           (0x00)              /**< (PMU_SPICTRL)  Offset */
#define PMU_SPISTATUS_REG_OFST         (0x04)              /**< (PMU_SPISTATUS)  Offset */
#define PMU_CLKCTRL_REG_OFST           (0x08)              /**< (PMU_CLKCTRL)  Offset */
#define PMU_MODECTRL1_REG_OFST         (0x0C)              /**< (PMU_MODECTRL1)  Offset */
#define PMU_MODECTRL2_REG_OFST         (0x10)              /**< (PMU_MODECTRL2)  Offset */
#define PMU_MODECTRL3_REG_OFST         (0x14)              /**< (PMU_MODECTRL3)  Offset */
#define PMU_MODECTRL4_REG_OFST         (0x18)              /**< (PMU_MODECTRL4)  Offset */
#define PMU_OVERCTRL_REG_OFST          (0x1C)              /**< (PMU_OVERCTRL)  Offset */
#define PMU_PMUCMODE_REG_OFST          (0x20)              /**< (PMU_PMUCMODE)  Offset */
#define PMU_PMUSTATUS_REG_OFST         (0x24)              /**< (PMU_PMUSTATUS)  Offset */
#define PMU_PMUSEQ1_REG_OFST           (0x28)              /**< (PMU_PMUSEQ1)  Offset */
#define PMU_PMUSEQ2_REG_OFST           (0x2C)              /**< (PMU_PMUSEQ2)  Offset */
#define PMU_PMUSEQ3_REG_OFST           (0x30)              /**< (PMU_PMUSEQ3)  Offset */
#define PMU_PMUSEQ4_REG_OFST           (0x34)              /**< (PMU_PMUSEQ4)  Offset */
#define PMU_PMUCFG_REG_OFST            (0x38)              /**< (PMU_PMUCFG)  Offset */
#define PMU_WCMCMD_REG_OFST            (0x3C)              /**< (PMU_WCMCMD)  Offset */
#define PMU_WCMWDATA_REG_OFST          (0x40)              /**< (PMU_WCMWDATA)  Offset */
#define PMU_WCMRDATA_REG_OFST          (0x44)              /**< (PMU_WCMRDATA)  Offset */
#define PMU_VBCCMD_REG_OFST            (0x48)              /**< (PMU_VBCCMD)  Offset */
#define PMU_VBCWDATA_REG_OFST          (0x4C)              /**< (PMU_VBCWDATA)  Offset */
#define PMU_VBCRDATA_REG_OFST          (0x50)              /**< (PMU_VBCRDATA)  Offset */
#define PMU_WCMCFG_REG_OFST            (0x54)              /**< (PMU_WCMCFG)  Offset */
#define PMU_PMUIENB_REG_OFST           (0x58)              /**< (PMU_PMUIENB)  Offset */
#define PMU_PMUISTAT_REG_OFST          (0x5C)              /**< (PMU_PMUISTAT)  Offset */

